[
    {
        "asin": "B08XM4TQF9",
        "title": "OPPSDECOR 900LBS Adjustable Weight Bench Press with Leg Extension and Preacher Curl Pad, Flat Incline Decline Utility Workout Bench for Home Gym Dumbbell Exercise",
        "price": 89.99,
        "brand": "OPPSDECOR",
        "description": null,
        "features": [
            "【Upgrade 900 LBS Weight Capacity】The OPPSDECOR Adjustable Weight Bench features upgraded sturdy steel and widened \"U\" leg design which forms a stable structure and double supports, enabling it to carry up to 900 pounds of load capacity and keep you and your family safe.",
            "【Premium Materials】The adjustable weight bench set is constructed from double thickened steel frame for stability and durability. OPPSDECOR is dedicated to produce high quality home gym exercise equipment and give you a great using experience.",
            "【Weight bench with Leg Extension and Leg Curl】 OPPSDECOR weight bench provided a removable preacher pad and Leg extension machine, you can decide whether to remove it according to your workout needs. Such a flexible adjustment allows you to exercise the pectoral muscles, shoulders, buttocks, abdomen, back muscle group training freely in all directions.",
            "【Adjustable Weight Bench Set】This weight lifting bench has 7 adjustable backrest positions and 3 level preacher curl pad. That you can easily adjust to incline, flat and decline positions. Multi-function leg developer provide you more fun.",
            "【Adjustable Weight Bench with Barbell Rack】 The barbell bars suitable for both Olympic (inner bore 50 mm) and normal one inch(Inner bore 25 mm), and you can put around 3-4 pieces (75 kg) plates on the bench. The best weight lifting bench for Leg exercise workout at home.",
            "【Ergonomic Design】Designed for home gyms, the Olympic weight bench features breathable leather upholstery and high-density foam, providing lasting comfort during weightlifting or seated exercises. This helps reduce muscle fatigue and minimizes the risk of injury during full-body movements.",
            "【Easy Assembly】The weight bench set comes with all the necessary tools and parts. With the bolts and nuts categorized and labeled, assembly becomes a breeze. Additionally, you don't need a professional to operate, It during workouts very easy to use. NOTE: This item doesn't include the barbell and weights! If you miss parts or have any questions, please contact us and we will provide solutions for you immediately."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "24 Kilograms"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "Red"
            },
            {
                "key": "Product Dimensions",
                "value": "59.1\"D x 29.7\"W x 36\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "900 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "OPPSDECOR"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "49.21 x 18.11 x 6.5 inches"
            },
            {
                "key": "Package Weight",
                "value": "24 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "59.1 x 29.7 x 36 inches"
            },
            {
                "key": "Brand Name",
                "value": "OPPSDECOR"
            },
            {
                "key": "Part Number",
                "value": "422"
            },
            {
                "key": "ASIN",
                "value": "B08XM4TQF9"
            },
            {
                "key": "Date First Available",
                "value": "October 21, 2023"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 24 Kilograms 89.99",
                "weight": "24 Kilograms",
                "price": 89.99,
                "remaining_products": 17,
                "color": "Red",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/71ntsnIEWIL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/419DR00A6nL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51GRtkRwoeL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51kK-IHyKaL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/413XxPlC1PL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/519LKUT9XtL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51ePDl8i+eL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B00B152GEQ",
        "title": "Body Champ Weight Bench with Leg Extension Attachment, 2-Piece Combo Adjustable Bench Press, Workout Bench and Squat Rack BCB3780, Gray/Silver",
        "price": 203.97,
        "brand": "Body Champ",
        "description": "Product DescriptionThe Body Champ Olympic Weight Bench combines quality and functionality to bring you a perfect piece of home gym equipment. If you're tired of spending thousands on equipment or paying monthly gym fees, customize your personal home gym instead. We're dedicated to bringing gym-quality workout and weightlifting equipment to the comfort and convenience of your own home. This Body Champ Olympic Weight Bench with Leg Extension Curl Lift Developer attachment will bring you the workout you crave. Whether you're bulking up your upper body with some chest presses or toning those muscles with leg lifts, this equipment is the ideal all-in-one machine. Freestanding uprights enable walk-in squat capability, and a locking leg-lift pin allows for sit-ups. Deluxe cushions, foam rollers, and a no-pinch grip design combine to give you a smooth and comfortable workout. This bench is compatible with Olympic weight sets up to 300 lbs., so you can work out with the pros. Save time, money, and space in your home gym by adding this weight bench to your routine. Try our Body Power, Body Champ, Body Rider family of products for all your at home exercise equipment.From the ManufacturerQuality-driven value. Since 1993, our company has been bringing quality gym-inspired products to the comfort of homes all across the globe. We believe that as a corporate body, we sustain the duty, desire, and understanding to help better your body. Your health, fitness, and wellness are always on our minds, and they are in good hands with us.",
        "features": [
            "Versatile Exercise Equipment: Perform Leg Lifts And Leg Curls, Chest Military Presses, And Other Weight Bench Workouts With This Multipurpose Workout Bench. If You Want Space-Saving, High-Quality Home Workout Equipment, Add This Bench To Start Your Journey Toward A Healthier You",
            "Not Your Regular Leg Press Machine: Our Dual-Action Leg Curl Lift Developer Allows You To Effectively Work Out Your Legs With Several Workout Combinations. Not Feeling Leg Day? Opt For Chest Presses Instead. Customize Your Workout To Meet Your Needs",
            "Multi-Use Gym Equipment: Choose From Incline, Flat, Decline, And Military Positions For Your Workouts, All On The Same Machine. Mixing Up Your Fitness Routine Helps Maximize Your Workout, Helps You Stay Consistent, And Keeps Boredom At Bay",
            "Quality Construction: Heavy-Duty Mainframe Tubing Ensures Durability, While Cushions Provide Comfort. Our Strength Training Equipment Is Not Only An Investment Into Your Home Gym, But Also An Investment In Your Health. Our Workout Equipment For Home Workouts Is Designed To Be Both Compact And Strong"
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "73 Pounds"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "Gray/Silver"
            },
            {
                "key": "Product Dimensions",
                "value": "44.13\"D x 78\"W x 69\"H"
            },
            {
                "key": "Frame Material",
                "value": "Iron"
            },
            {
                "key": "Weight Limit",
                "value": "300 Pounds"
            },
            {
                "key": "Global Trade Identification Number",
                "value": "00878932004195"
            },
            {
                "key": "Manufacturer",
                "value": "Hupa International, Inc."
            },
            {
                "key": "UPC",
                "value": "878932004195"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "53 x 25.5 x 7.5 inches"
            },
            {
                "key": "Package Weight",
                "value": "35.38 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "44.13 x 78 x 69 inches"
            },
            {
                "key": "Brand Name",
                "value": "Body Champ"
            },
            {
                "key": "Part Number",
                "value": "BCB3780"
            },
            {
                "key": "ASIN",
                "value": "B00B152GEQ"
            },
            {
                "key": "Date First Available",
                "value": "January 10, 2013"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 73 Pounds 203.97",
                "weight": "73 Pounds",
                "price": 203.97,
                "remaining_products": 96,
                "color": "Gray/Silver",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/61XogRA-1FL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/413Q4v2bhBL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41RHe+56VqL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41RHe+56VqL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41iK82CsXRL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41y4PGFMfHL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0DJKPQ9QC",
        "title": "Adjustable Weight Bench with Preacher Pad, Leg Extension and Leg Curl, 800LBS Workout Bench with Handle Bar, FID Bench for Strength Training Full Body Workout",
        "price": 109.99,
        "brand": "RUNFREELY",
        "description": null,
        "features": [
            "【A WHOLE BODY WORKOUT MACHINE】RUNFREELY weight bench come with leg and arm developer, which can provide a greater versatility in your workouts! A flexible adjustment allows you to exercise the pectoral muscles, shoulders, buttocks, abdomen, back muscle group training freely in all directions.",
            "【LEG DEVELOPER AND ARM DEVELOPER】 This exercise bench includes a leg extension and height-adjustable preacher curl attachment for more exercise such as Seated Leg Extension, Prone Leg Curl, Preacher Curl and so on.",
            "【FID BENCH】This bench adjusts quickly and easily from Flat to Incline to Decline thanks to our updated spine construction, which locks firmly into place using a simple pop pin. It features 11 back pad positions (from -20 to 85 degree) and 3 seat positions (from 0 to 20 degree).",
            "【HEAVY-DUTY BENCH】Made of 2”X2” steel frame and triangular mechanical support design; 50 mm thickened backrest and 5 layers leather foam back cushion provide a much more comfortable workout bench experience; Upgraded Weight Capacity: 800 lbs.",
            "【Easy Assemble】 It will come with the whole set of installation tools, and installation guidance and customer service 24 hours for you. We also provide 1 year warranty for this bench."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "40 Pounds"
            },
            {
                "key": "Material",
                "value": "MULTIFUNCTION"
            },
            {
                "key": "Color",
                "value": "BLACK"
            },
            {
                "key": "Product Dimensions",
                "value": "56\"D x 27\"W x 49\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "1000 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "RUNFREELY"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "56 x 27 x 49 inches"
            },
            {
                "key": "Brand Name",
                "value": "RUNFREELY"
            },
            {
                "key": "Part Number",
                "value": "AHACWB"
            },
            {
                "key": "ASIN",
                "value": "B0DJKPQ9QC"
            },
            {
                "key": "Date First Available",
                "value": "October 6, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 40 Pounds 109.99",
                "weight": "40 Pounds",
                "price": 109.99,
                "remaining_products": 49,
                "color": "BLACK",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/61yletSrGEL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41jTLpa7jML._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41aaAztSFwL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41t4-cjUoGL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41ZurOedRoL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41js0K0OOwL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/410Nm4Af07L._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B09LVTDNXH",
        "title": "Roman Chair Back Extender - Angle & Height Dual Adjustable Hyperextension Bench for Home Gym - Adjustable Back Exercise Machine",
        "price": 129.99,
        "brand": "SUCXDZQ",
        "description": null,
        "features": [
            "Efficient Back Training – Designed for optimal back muscle strengthening and stretching. The 45-degree ergonomic design ensures stability, accommodating users up to 6.3 feet tall. Ideal for enhancing your home gym routine with effective back workouts",
            "Multifunctional Fitness Equipment – This versatile back extension bench targets back, core, hip, and leg muscles while supporting ab and arm exercises. Perfect for full-body workouts at home, providing a comprehensive fitness solution in one compact machine",
            "Durable Construction – Crafted from high-strength carbon steel with an anti-abrasive coating, this hyperextension bench offers cushioned support and foot pads for comfort. It supports up to 245 pounds, ensuring long-lasting durability in your home gym",
            "Easy to Assemble – Includes clear instructions and all necessary hardware for a quick 30-minute assembly. The straightforward setup allows you to start your fitness routine with minimal effort, making it an ideal addition to any home gym",
            "Practical and Stylish Design – The sleek, minimalist design of this bench integrates seamlessly into any home gym. Its compact form factor fits into limited spaces while providing maximum functionality for a wide range of workout routines"
        ],
        "attributes": [
            {
                "key": "Product Dimensions",
                "value": "43.4\"D x 23.5\"W x 26.7\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "245 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "SUCXDZQ"
            },
            {
                "key": "UPC",
                "value": "768492071006"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "29 x 21.3 x 5.6 inches"
            },
            {
                "key": "Package Weight",
                "value": "13.34 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "43.4 x 23.5 x 26.7 inches"
            },
            {
                "key": "Brand Name",
                "value": "SUCXDZQ"
            },
            {
                "key": "Warranty Description",
                "value": "T"
            },
            {
                "key": "Suggested Users",
                "value": "Unisex-Adult"
            },
            {
                "key": "Included Components",
                "value": "steel"
            },
            {
                "key": "ASIN",
                "value": "B09LVTDNXH"
            },
            {
                "key": "Date First Available",
                "value": "November 15, 2021"
            }
        ],
        "equipment_options": [
            {
                "name": "White",
                "weight": 13.335604799999999,
                "price": 129.99,
                "remaining_products": 62,
                "color": "White",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/31OswrhC8IL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61v83nX15+L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71wcszqUNaL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61BmHLlacoL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71R7IMTThCL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/710dv01GdgL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71oI+T-Qe1L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71Jk4PDXkxL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81Sxrh39S2L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71MZpbOrIGL._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "Black",
                "weight": 13.335604799999999,
                "price": 129.99,
                "remaining_products": 60,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/31yq+BvIucL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61wpI+YKwYL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81aINV5iqEL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81N-4DM0PEL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81feQHvShAL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81BdEntaqLL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/812JK4vrwmL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71g6WSAe1BL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71YiC4iF84L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71laWijfK2L._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "model_name": "A",
        "color": "White",
        "material": "Alloy Steel",
        "weight": "29.4 Pounds",
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0CJQVP5Q6",
        "title": "Adjustable Weight Bench with Leg Extension and Preacher Pad, 800lbs Workout Bench for Home Gym, Flat Incline Decline Bench Press Leg Curl for Home Workout Weight Training",
        "price": 169.99,
        "brand": "TYRSEN",
        "description": null,
        "features": [
            "𝙐𝙋𝙂𝙍𝘼𝘿𝙀𝘿 𝙈𝙐𝙇-𝙁𝙐𝙉𝘾𝙏𝙄𝙊𝙉𝘼𝙇 𝙒𝙀𝙄𝙂𝙃𝙏 𝘽𝙀𝙉𝘾𝙃: Built with a commercial-grade welded main frame for superior strength and stability. With a 22.5\" extra wide base, TYRSEN weight bench ensures rock-solid stability during intense workouts. Max Weight Capacity: 800 lbs, perfect for powerlifting enthusiasts.",
            "𝙁𝙐𝙇𝙇𝙔 𝘼𝘿𝙅𝙐𝙎𝙏𝘼𝘽𝙇𝙀 𝘼𝙉𝘿 𝙑𝙀𝙍𝙎𝘼𝙏𝙄𝙇𝙀: Featuring 6 backrest positions, 4 arm training positions, 3 seat positions, and 3 leg curl positions, this adjustable bench offers endless workout possibilities. Easily switch between exercises like seated dumbbell presses, flat bench presses, and decline sit-ups. Ideal for hardcore home gym enthusiasts.",
            "2-𝙄𝙉-1 𝙒𝙀𝙄𝙂𝙃𝙏 𝙍𝙊𝘿 𝙊𝙁 𝙇𝙀𝙂 𝙀𝙓𝙏𝙀𝙉𝙎𝙄𝙊𝙉: Designed to accommodate both Olympic (2\" inner hole) and standard (1\") weight plates, the barbell rack fits to help you storage your barbell plates and add it for leg extension and curl. Perfect for hardcore strength training and muscle building at home.",
            "𝙍𝙀𝙈𝙊𝙑𝘼𝘽𝙇𝙀 & 𝘼𝘿𝙅𝙐𝙎𝙏𝘼𝘽𝙇𝙀 𝙋𝙍𝙀𝘼𝘾𝙃𝙀𝙍 𝙋𝘼𝘿: TYRSEN Workout bench equips with an extra removable leg extension and a preacher pad. We have also enlarged the size of the preacher pad so that both men and women can comfortably use it to perform preacher curls and enhance arm strength.",
            "𝙀𝙓𝙏𝙍𝘼 𝙒𝙄𝘿𝙀 𝘼𝙉𝘿 𝙀𝙓𝙏𝙍𝘼 𝙏𝙃𝙄𝘾𝙆 𝘾𝙐𝙎𝙃𝙄𝙊𝙉: The 2.3\" thickened cushion with premium leather upholstery of TYRSEN mul-propose bench press provides exceptional support and comfort during heavy lifting sessions. Designed to withstand rigorous use and provide long-lasting durability.",
            "𝙀𝘼𝙎𝙔 𝘼𝘿𝙅𝙐𝙎𝙏𝙈𝙀𝙉𝙏𝙎 𝘼𝙉𝘿 𝙈𝙊𝘽𝙄𝙇𝙄𝙏𝙔: Say goodbye to pin-pulling hassles with the profile C-shaped locking latch that allows quick and easy changes in angle and height. Wheels on the heavy duty weight bench base enable easy mobility.",
            "𝙉𝙊 𝙒𝙊𝙍𝙍𝙔 𝘽𝙐𝙔𝙄𝙉𝙂: Includes a complete assembly guide and tools for quick setup. Customer service team available for any assistance."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "24 Kilograms"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "Black-Red"
            },
            {
                "key": "Product Dimensions",
                "value": "65\"D x 22.5\"W x 40.1\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "800 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "TYRSEN"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "50 x 14.5 x 12 inches"
            },
            {
                "key": "Package Weight",
                "value": "24.81 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "65 x 22.5 x 40.1 inches"
            },
            {
                "key": "Brand Name",
                "value": "TYRSEN"
            },
            {
                "key": "Part Number",
                "value": "WB-Leg Extension"
            },
            {
                "key": "ASIN",
                "value": "B0CJQVP5Q6"
            },
            {
                "key": "Date First Available",
                "value": "September 25, 2023"
            }
        ],
        "equipment_options": [
            {
                "name": "Textured Black",
                "weight": 24.0,
                "price": 99.99,
                "remaining_products": 8,
                "color": "Red, Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41tLbszZfcL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71+eLT5Z7rL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71DbjYx9PJL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71Fjp0ooxTL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/815zAsvyvTL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81EAHBr8ijL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81lgUS8WUGL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71rp2Udr5lL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/714wzbsB+YL._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "Black-Red",
                "weight": 24.0,
                "price": 169.99,
                "remaining_products": 12,
                "color": "Red, Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41mASt3XPML._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71UAxyZmuDL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71bl4ue1SlL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81otuUyrhML._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81Q-38fD8vL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71zJ9WYPJ7L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81SfA+JgpxL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81e3XBaMkJL._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B000LORPTY",
        "title": "Body Solid Powerline (GLDA1) Leg Developer Attachment for PFID130X Bench, High Performance Commercial and Home Gym Leg Attachment for Weight Bench Strengthening Hamstring/Glutes, Thigh and Knees",
        "price": 140,
        "brand": "Body solid",
        "description": "Product DescriptionLeg Developer Attachment. Leg Extensions are designed for ultimate strengthening of the Knee and Thigh muscles. Leg Curls for maximum concentration of Hamstring and Glute muscles.Amazon.comThe GLDA1 Leg Developer Attachment is designed for use with Powerline's PFID130X Flat Incline Decline Bench. The attachment allows you to perform leg extensions to strengthen your knee and thigh muscles and leg curls which concentrate on your hamstring and gluteus muscles. The PFID130X Bench is sold separately.",
        "features": [
            "INDUSTRY LEADER: For 30+ years, Body Solid has held the widest array of products designed to meet the demands of the ever-changing fitness industry (home gym, free weight machines, treadmills, bikes, ellipticals, workout bench, leg extension, weight plates, kettlebells, dumbbells, flooring, accessories and more). Our products are cutting edge and reliable and are built for Life……Your Life.",
            "MAXIMIZE LEG STRENGTH: Transform your Powerline PFID130X Bench with the leg attachment for weight bench to enhance hamstring and glute muscle power. Experience targeted workouts that effectively strengthen and tone your lower body, elevating your fitness routine for noticeable results. With every session, achieve your fitness goals more efficiently by directly targeting key muscle groups.",
            "EFFICIENT WORKOUT INTEGRATION: Seamlessly incorporate this leg attachment into your fitness regimen and harness the power of consistent lower body training. By adding this tool, you can combine upper and lower body workouts without the need for multiple equipment pieces, saving you space and time.",
            "VERSATILE MUSCLE BUILDING TOOL: GLDA1 helps in building lower body strength and muschle definition. This flexibility empowers users to tailor their sessions, providing well-rounded training from the convenience of their home or even in a commercial gym setup.",
            "UNPARALLELED COMFORT AND SUPPORT: Designed with ergonomics in mind, this leg extension ensures maximum comfort while undertaking intense routines. Soft padding minimizes strain, letting you focus solely on your performance. Push harder in your workouts without compromising on safety or comfort, ensuring repeated use benefits your fitness journey without interruption."
        ],
        "attributes": [
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "20.98 x 16.97 x 5.2 inches"
            },
            {
                "key": "Package Weight",
                "value": "6.64 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "17 x 20 x 5 inches"
            },
            {
                "key": "Item Weight",
                "value": "5 Kilograms"
            },
            {
                "key": "Brand Name",
                "value": "Body-Solid"
            },
            {
                "key": "Color",
                "value": "Grey / Black"
            },
            {
                "key": "Material",
                "value": "Faux Leather"
            },
            {
                "key": "Number of Items",
                "value": "1"
            },
            {
                "key": "Manufacturer",
                "value": "Body-Solid"
            },
            {
                "key": "Part Number",
                "value": "GLDA-1"
            },
            {
                "key": "Model Year",
                "value": "2018"
            },
            {
                "key": "Style",
                "value": "Leg Developer (GLDA1)"
            },
            {
                "key": "Sport Type",
                "value": "Weightlifting"
            },
            {
                "key": "ASIN",
                "value": "B000LORPTY"
            },
            {
                "key": "Date First Available",
                "value": "March 25, 2008"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 5 Kilograms 140",
                "weight": "5 Kilograms",
                "price": 140,
                "remaining_products": 59,
                "color": "Grey / Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/51oj+zZ6FaL._AC_SY300_SX300_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/31OkkIKxXbL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B06XCCDV49",
        "title": "Sunny Health & Fitness Foldable Hyperextension Roman Chair w/Back Extension, Home Gym Sit Up Bench for Glute & Ab Workouts, Optional Adjustment Incline & Multi-Function Heavy-Duty Exercise Equipment",
        "price": 79.99,
        "brand": "Sunny Health & Fitness",
        "description": null,
        "features": [
            "LOWER BODY WORKOUT: Targets the lower back, hip and glutes.",
            "EXPERT DESIGNED: Features a sleek and sturdy compact steel frame design ideal for home use.",
            "SPACE SAVING: Foldable for easy storage, convenience and portability.",
            "COMFORT: high density foam hip support pads with foam leg rollers.",
            "CUSTOMIZATION: Adjustable for different height requirements, maximum weight capacity is 250 LB.",
            "NONSLIP HANDLEBARS: Maintain a solid grip while you work on your gains."
        ],
        "attributes": [
            {
                "key": "Product Dimensions",
                "value": "39\"D x 33\"W x 24\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "250 Pounds"
            },
            {
                "key": "Global Trade Identification Number",
                "value": "00815749011473"
            },
            {
                "key": "Manufacturer",
                "value": "Sunny Health & Fitness"
            },
            {
                "key": "UPC",
                "value": "815749011473"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "30 x 15.4 x 5 inches"
            },
            {
                "key": "Package Weight",
                "value": "11.61 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "39 x 33 x 24 inches"
            },
            {
                "key": "Brand Name",
                "value": "Sunny Health & Fitness"
            },
            {
                "key": "Number of Items",
                "value": "1"
            },
            {
                "key": "Part Number",
                "value": "SF-BH6629"
            },
            {
                "key": "Model Year",
                "value": "2019"
            },
            {
                "key": "Style",
                "value": "Roman Chair"
            },
            {
                "key": "Included Components",
                "value": "User Manual, Romain Chair"
            },
            {
                "key": "Fill Material Type",
                "value": "Foam"
            },
            {
                "key": "ASIN",
                "value": "B06XCCDV49"
            },
            {
                "key": "Date First Available",
                "value": "February 28, 2017"
            }
        ],
        "equipment_options": [
            {
                "name": "Roman Chair",
                "weight": 10.886208,
                "price": 79.99,
                "remaining_products": 17,
                "color": "White",
                "img": [
                    {
                        "link": null,
                        "is_primary": true
                    }
                ]
            },
            {
                "name": "Multi Function Roman Chair",
                "weight": 10.886208,
                "price": 79.99,
                "remaining_products": 33,
                "color": "White",
                "img": [
                    {
                        "link": null,
                        "is_primary": true
                    }
                ]
            }
        ],
        "model_name": "Sunny Health & Fitness SF-BH6629 45 Degree Hyperextension Roman Chair",
        "color": "White",
        "material": "Alloy Steel",
        "weight": "24 Pounds",
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0D12JWYV3",
        "title": "Adjustable Weight Bench with Leg Extension and Preacher Pad, Adjustable 6 Position Utility Bench, Workout Bench for Home Gym, Leg Extension and Curl Machine",
        "price": 129.99,
        "brand": "Fitvids",
        "description": "Fitvids Adjustable Weight Bench with Leg Extension and Preacher Pad, Adjustable 6 Position Utility Bench, Workout Bench for Home Gym, Leg Extension and Curl Machine",
        "features": [
            "【Adjustable Design】Adjustable weight bench is adjustable in 6 positions, the legrest is adjustable in 3 positions, you can choose the position that suits you. Our products are suitable for full-body exercise, such as bench press, back extension, leg curl and seated leg extension, fulfill all your workout needs.",
            "【Additional Accessories】Our workout bench has one 11.42\" long weight holder can hold enough 2\" center hole plates to achieve the training effect you want. You can change the weight of your workout by adjusting the number of plates to get different workout levels. The innovative design of the movable v-handle adds to your workout options and use it for convenience. You can perform v-handle workout, or do the preacher curl conveniently with curl pad.",
            "【Comfort Details】Bench cushion is made of soft leather and high-density foam, allowing you to work out in comfort with less strain on your lower back. The unit has comfortable foam roller pads that provide a comfortable leg stretching workout. These are designed to effectively extend workout time and improve workout results. In addition, the PU leather is securely and wear-resistant and can be easily maintained with a damp cloth.",
            "【Structural Stability】The more stable base design compared with the general fitness bench ensures the safety of your workout. It is a good choice for your home fitness.",
            "【Material Upgrade】Weight bench’s overall stand is made of 50×50 mm and 45×45 mm thick steel pipe, which ensures stability and durability during intense workouts. Product size: 65.35”×27.32”×36.22”."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "57.3 Pounds"
            },
            {
                "key": "Material",
                "value": "Carbon Steel, Leather, High-Density Foam"
            },
            {
                "key": "Color",
                "value": "Black"
            },
            {
                "key": "Product Dimensions",
                "value": "72.44\"D x 27.32\"W x 51.97\"H"
            },
            {
                "key": "Frame Material",
                "value": "Carbon Steel"
            },
            {
                "key": "Weight Limit",
                "value": "57.32 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "Signature Fitness"
            },
            {
                "key": "UPC",
                "value": "810133186690"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "54 x 17.75 x 8.25 inches"
            },
            {
                "key": "Package Weight",
                "value": "28.58 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "72.44 x 27.32 x 51.97 inches"
            },
            {
                "key": "Brand Name",
                "value": "Fitvids"
            },
            {
                "key": "Part Number",
                "value": "QD-SF-LX550"
            },
            {
                "key": "Style",
                "value": "Bench Only"
            },
            {
                "key": "ASIN",
                "value": "B0D12JWYV3"
            },
            {
                "key": "Date First Available",
                "value": "April 7, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 57.3 Pounds 129.99",
                "weight": "57.3 Pounds",
                "price": 129.99,
                "remaining_products": 21,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/71d8Myjp4rL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41yBDz1C4yL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41byI08g-PL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51387WEAWeL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51dmcHimlSL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41-wbcPeGtL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41PfxPJNR7L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51VyJcRVl-L._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0D9NKQZ1X",
        "title": "Adjustable Weight Bench, Multi-function Preacher Curl Bench for Home Gym, Foldable Leg Extension and Leg Curl Machine, weight capacity 660LBS.",
        "price": 179.99,
        "brand": "Z ZHICHI",
        "description": null,
        "features": [
            "💪【SUPER SALE POINTS】：Adjustable weight bench space design conforms to the human body engineering,fitness enthusiasts of all heights have room to do exercises like leg extensions,the enlarged and lengthened double-deck preacher pad is very effective for the double hands dumbbell bending, roman chair abdomen bending and other functions. Whole bench leather is 1.4mm thickness,comfort and exquisite feeling far beyond competitors, 2 in 1 weight rod can fit dumbbell & Olympic weight plates..",
            "💪【LEG EXTENSION AND CURL】We set a height adjustment under the seat and can make a comfort height when do lying leg curl workout. When do these leg workout function, we suggest to remove the preacher pad subassembly. After long-term testing, the function is real, effective and comfortable.",
            "💪【MATERIAL & WEIGHT】: 50*50mm carbaon steel, 1.4mm thickness pipe as main frame pipe, ensure the steady form when you do workout. Our adjustable weight bench net weight is 20KG, 660LBS weight capacity, far beyond homeuse standard.",
            "💪【ADJUSTMENT & FUNCTION】: Workout bench has 10 backrest pad positions and 3 preacher pad degrees to meet your home gym demand. Adjustable weight bench is ideal for full-size adult working out and training on your chest,shoulder,back,abs,leg and more.",
            "💪【LEATHER & CUSHION】: 1.4mm thickness leather and double-deck wooden boards design has sofa's touch feeling, comfortable high-density foam padding and seat secure body firmly and reduces muscle fatigue during workout.",
            "💪【FOLD & STORAGE】: 90% bench is pre-assembled, fold and storage easily with 10s. folded size is 31.8\" L x14.2\" W x12.2\". H",
            "💪【 2 IN 1 WEIGHT ROD】: The set of adjustable weight bench doesn't include the leg weights, but we provide 2 in 1 weight rod and block to match your different weight plates."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "45 Pounds"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "orange"
            },
            {
                "key": "Product Dimensions",
                "value": "68.9\"D x 23.6\"W x 45.3\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "660 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "ZHICHI"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "32 x 14 x 12.5 inches"
            },
            {
                "key": "Package Weight",
                "value": "21.81 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "68.9 x 23.6 x 45.3 inches"
            },
            {
                "key": "Brand Name",
                "value": "Z ZHICHI"
            },
            {
                "key": "Part Number",
                "value": "021DZR"
            },
            {
                "key": "ASIN",
                "value": "B0D9NKQZ1X"
            },
            {
                "key": "Date First Available",
                "value": "July 18, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "black&red",
                "weight": 20.41164,
                "price": 149.99,
                "remaining_products": 2,
                "color": "Red, Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/51XRqOtQIxL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71Ii1NiUdIL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61sUJMmGkqL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81mXdXLPZHL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71Dj7HSjfmL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71dF-F2vrfL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71VidyOWkaL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41Fh3ULlExL._AC_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "orange",
                "weight": 20.41164,
                "price": 179.99,
                "remaining_products": 47,
                "color": "Orange",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41GfRgg3+QL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61b7TT+qY6L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71ZRtAWPRtL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61cdrNRhZGL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71fOh1TBZlL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71dDpPBlI+L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71sJAW4NulL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81tff7EhyxL._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0CH1JGSL9",
        "title": "Leg Press Machine Pad - Fitness Exercise Attachment for Gym Machines - Body Building Accessory & Equipment - Compact Portable Wedge for Lower Back & Knee - Squat Replacement Hip Workout",
        "price": 44.99,
        "brand": "Motion Molds",
        "description": null,
        "features": [
            "🌱 DECREASE BACK PRESSURE: Experience a safer lift with our leg press attachment that minimizes lower back rounding and maintains your spine's natural curve. This essential piece of workout equipment is designed to seamlessly integrate with standard gym equipment ensuring safety and efficiency. Elevate your training with this gym machine equipment. Our leg press attachment for smith machine ensures compatibility with various gym equipment, making it a sought piece of rehabilitation equipment.",
            "🏃🏽‍♂️ INCREASE RANGE OF MOTION: Don't settle for half reps due to discomfort. Our supportive padding for the lower back ensures a deeper, pain-free stretch. As a pivotal piece of exercise equipment, it revolutionizes the way you use leg workout equipment, maximizing your gains. Designed for those serious about their leg machine exercise equipment, our product is a versatile addition to any home gym bench with leg press.",
            "🦵 TARGET QUADS EFFICIENTLY: Elevate your hips for an optimal angle, emphasizing quadricep engagement without risking spinal injury. When paired with the leg press hack squat machine combo, this fitness equipment ensures you get the most out of every rep. Whether you have a body solid leg press hack squat or a gmwd leg press hack squat machine, our wedge enhances quad targeting.",
            "📈 ENHANCE HIP MOBILITY: Enjoy a smoother range of motion with elevated hips, ensuring clean, consistent reps. This is the perfect addition to your leg press home gym, enhancing the utility of your existing weight lifting equipment. As a premier piece of hip trainer and small exercise equipment, our leg press wedge works seamlessly with different setups, elevating your hip exercise.",
            "🔥 ENGAGE YOUR CORE: Our design promotes lower back curvature, allowing for active core engagement and spine protection during your lift. It stands out in the realm of weight equipment and strength training equipment, prioritizing both muscle engagement and safety. Engaging the core is crucial, especially when using leg press machines for home gym or workout equipment leg press."
        ],
        "attributes": [
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "12.48 x 11.97 x 4.33 inches"
            },
            {
                "key": "Package Weight",
                "value": "0.59 Kilograms"
            },
            {
                "key": "Item Weight",
                "value": "14.4 ounces"
            },
            {
                "key": "Brand Name",
                "value": "Motion Molds"
            },
            {
                "key": "Color",
                "value": "Black"
            },
            {
                "key": "Number of Items",
                "value": "1"
            },
            {
                "key": "Manufacturer",
                "value": "Motion Molds"
            },
            {
                "key": "ASIN",
                "value": "B0CH1JGSL9"
            },
            {
                "key": "Date First Available",
                "value": "August 31, 2023"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 14.4 ounces 44.99",
                "weight": "14.4 ounces",
                "price": 44.99,
                "remaining_products": 95,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/61x9wnty9wL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/31gHdEwvJ6L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51KTjMJznbL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51PePhkV9aL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/511hkZNuoJL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51brYF8UP0L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/511aBPkSuPL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0DJ2Q2WD4",
        "title": "FEIERDUN Leg Stretcher, Leg Stretcher Machine for Flexibility and Relieving Hip Tightness, Heavy Duty Split Machine Stretcher for Home Gym Split Machine Training Fitness",
        "price": 125.99,
        "brand": "FEIERDUN",
        "description": null,
        "features": [
            "Designed for leg and hip flexibility: The leg stretcher targets leg muscle groups. It improves flexibility, shapes ideal legs, strengthens lower body muscles, and excels in stretching exercises to help you achieve the perfect split safely and flexibly",
            "Progressive Adjustment within 0°-190°: Simply turn the handwheel gently to stretch the legs, suitable for beginners to professionals. You can read while stretching; The bottom mute wheel ensure stability when in use, preventing scratches on the floor",
            "Sturdy Support without Wobbling: Built with 1.5mm thickened steel, it provides superior support and durability and can withstand up to 300lbs. The 4 sturdy leg posts at the bottom provide unmatched stability, ensuring you can focus on your training",
            "Sit in Comfort, Stretch with Ease: Crafted with wear and sweat resistan leather, you don't have to worry even if you sweat. The thickened cushions ensure comfort during exercise. The protective pads fit perfectly on your calf and avoid injuries when you use it",
            "3-Step Setup with Compact Storage: The leg stretcher arrives 95% pre-assembled, requiring only 3-step to complete setup. With its compact design, you can do your workout with ease. When not in use, you can easily store it in every corner of your home",
            "The perfect family fitness choice: Ideal for children, adults and small people, the leg strecher offers flexible angle adjustment for safe, gentle stretching. A must-have for dancers, gymnasts, and fitness enthusiasts aiming to improve leg flexibility and strength",
            "No Worry Service: our leg stretcher machine comes with detailed assembly instructions and installation video to make setup a breeze. If you encounter product damage or other problems, please let us know, and we will help you solve the problem"
        ],
        "attributes": [
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "37.2 x 15.6 x 8.6 inches"
            },
            {
                "key": "Package Weight",
                "value": "12.04 Kilograms"
            },
            {
                "key": "Brand Name",
                "value": "FEIERDUN"
            },
            {
                "key": "Warranty Description",
                "value": "1 year"
            },
            {
                "key": "Suggested Users",
                "value": "unisex-adult"
            },
            {
                "key": "Manufacturer",
                "value": "FEIERDUN"
            },
            {
                "key": "Included Components",
                "value": "Leg Machines"
            },
            {
                "key": "ASIN",
                "value": "B0DJ2Q2WD4"
            },
            {
                "key": "Date First Available",
                "value": "September 27, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 12.04 Kilograms 125.99",
                "weight": "12.04 Kilograms",
                "price": 125.99,
                "remaining_products": 79,
                "color": "Black orange",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/71wBX8WufML.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41s3nDSSd9L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51VA+QtvD9L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51BSBC8U7HL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51fvCRTO7HL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41dMvVFmuDL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41IY+OmLp9L._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "model_name": "PTJ-01",
        "color": "Black orange",
        "material": "Alloy Steel, PU Leather",
        "weight": "12.04 Kilograms",
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B07MWV1JD7",
        "title": "Sunny Health & Fitness Sitting Under Desk Elliptical Exerciser, Portable Pedal Training Machine for Senior Exercise, Peddler for Home Workout, Optional Free SunnyFit App, Magnetic, Motorized & In Pink",
        "price": 96.98,
        "brand": "Sunny Health & Fitness",
        "description": null,
        "features": [
            "【Low Impact Exercise Companion】The under-desk pedal exerciser provides a low-impact workout, perfect for burning calories, and toning muscles, without putting strain on your joints. Reviewed by over 10000+ satisfied customers.",
            "【Smooth & Silent Operation】 This mini elliptical, featuring a belt drive mechanism with magnetic resistance, ensures a quiet, smooth, and maintenance-free workout experience.",
            "【Versatile Compact Design】 Engineered with an innovative pedal motion trajectory, this slim elliptical trainer tucks easily under most desks, ensuring a comfortable fit and smooth movement without the risk of knee contact. Its versatile build allows you to integrate exercise effortlessly into your daily life, whether at home or in the office.",
            "【Comprehensive Digital Monitor】 Stay updated with your workout progress via our centrally located digital monitor. It offers real-time data on time, speed, calories, and distance.",
            "【Customizable Magnetic Resistance】 With 8 levels of adjustable magnetic resistance, customize your workout to match your fitness level, enhancing muscular endurance over time.",
            "【Fully Assembled】 Our under-desk elliptical arrives fully assembled, letting you kick-start your fitness journey right out of the box.",
            "【Easy to Store & Transport】 Lightweight and compact, this elliptical is easy to store under desks or tables. Its integrated handgrip ensures effortless transportation.",
            "【Reliable Quality】 Trust in the durability, reliability, and efficiency of our under-desk elliptical, a product of Sunny Health & Fitness, with over 20 years of industry experience."
        ],
        "attributes": [
            {
                "key": "Product Dimensions",
                "value": "25\"D x 20\"W x 12\"H"
            },
            {
                "key": "Resistance Mechanism",
                "value": "Magnetic"
            },
            {
                "key": "Maximum Weight Recommendation",
                "value": "250 Pounds"
            },
            {
                "key": "Maximum Stride Length",
                "value": "7 Inches"
            },
            {
                "key": "Screen Size",
                "value": "7 Inches"
            },
            {
                "key": "Number of Resistance Levels",
                "value": "8"
            },
            {
                "key": "Manufacturer",
                "value": "Sunny Health & Fitness"
            },
            {
                "key": "UPC",
                "value": "815749012722"
            },
            {
                "key": "Global Trade Identification Number",
                "value": "00815749012722"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "25 x 20.5 x 12.8 inches"
            },
            {
                "key": "Package Weight",
                "value": "13.38 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "25 x 20 x 12 inches"
            },
            {
                "key": "Brand Name",
                "value": "Sunny Health & Fitness"
            },
            {
                "key": "Warranty Description",
                "value": "1 Year Structural Frame, 180 Days Other Parts And Components"
            },
            {
                "key": "Suggested Users",
                "value": "unisex-adult"
            },
            {
                "key": "Number of Items",
                "value": "1"
            },
            {
                "key": "Part Number",
                "value": "SF-E3872"
            },
            {
                "key": "Model Year",
                "value": "2019"
            },
            {
                "key": "Style",
                "value": "Classic"
            },
            {
                "key": "Included Components",
                "value": "Elliptical, User Manual"
            },
            {
                "key": "Size",
                "value": "One Size"
            },
            {
                "key": "Sport Type",
                "value": "Walking, Cycling, Exercise & Fitness"
            },
            {
                "key": "ASIN",
                "value": "B07MWV1JD7"
            },
            {
                "key": "Date First Available",
                "value": "January 17, 2019"
            }
        ],
        "equipment_options": [
            {
                "name": "Classic",
                "weight": 11.3398,
                "price": 96.98,
                "remaining_products": 59,
                "color": "Gray-Magnetic",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/415v7owB2qL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61D7vcriVAL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71GpNVUh5wL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71KJba1RQ0L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71CP6RE+HuL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81htD7-xQiL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61Y4TyKq-TL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81Y6jb5l6AL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/91z7ZVfPCSS._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/412ctu+OvpS._AC_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "Smart & Motorized",
                "weight": 11.3398,
                "price": 96.98,
                "remaining_products": 37,
                "color": "Gray-Magnetic",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41GjaQV2ShL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71fkuMtA9cL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81ohyCF-mgL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/817tzIlIxHL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81cKY8qjrOL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81mVmeSlUtL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81trs4QzkNL._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "Smart Pink",
                "weight": 11.3398,
                "price": 96.98,
                "remaining_products": 76,
                "color": "Pink",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41Txh48j40L._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/617HVe6hECL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61kk61Zg49L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71Dr+96WQ5L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61DnwBh9QvL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71mRPXGdA9L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71Q0XgpTGDL._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "Smart",
                "weight": 11.3398,
                "price": 96.98,
                "remaining_products": 2,
                "color": "Gray-Magnetic",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41ZYCRYT73L._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71TqWo7tLNL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71SV34bSCYL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71Pbcs-SLaL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81N8Q2XQuWL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81Oe9XwilKL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81-LG4t313L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/817tzIlIxHL._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "Classic Pink",
                "weight": 11.3398,
                "price": 96.98,
                "remaining_products": 24,
                "color": "Pink",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41GIzbnwdiL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71MEQemEeiL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/91j23pTbxgL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61ZGDsl+f2L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61pnHqqrmoL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/81GefW+G2dL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61kWL96sZ6L._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "model_name": "SF-E3872",
        "color": "Gray-Magnetic",
        "material": "Alloy Steel",
        "weight": "25 Pounds",
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0CM651XC5",
        "title": "1500LBS 6 in 1 Weight Bench Set with Leg Extension/Curl and Preacher Curl, Bench Press Set and barbell Rack with Safety Bar Catches, Foldable Workout Benches for Home(US Stock)",
        "price": 249.99,
        "brand": "MAIDOMA",
        "description": "MAIDOMA 1500LBS 6 in 1 Weight Bench Set with Leg Extension/Curl and Preacher Curl, Bench Press Set and barbell Rack with Safety Bar Catches, Foldable Workout Benches for Home(US Stock)",
        "features": [
            "【Wider Higher Rack&Bigger Size】We find most benches with rack in the market are too narrow for adults to do proper bench press and it is a hassle to disassemble to return it. So this MAIDOMA weight bench was invented! 6ft and 7ft bars fit perfectly for this bench. The bigger size and wider higher rack make squats available, offer more stability, and make MAIDOMA weight bench set more suitable for teens and adults.",
            "【Real 6 IN 1 】Get 6 functional equipment in 1 MAIDOMA workout bench. What you get is not only a weight bench but also a squat rack, a preacher curl pad, a V-handle, a leg developer machine and a chest fly workout equipment. Ideal for beginners and intermediate lifters looking to build strength and improve fitness at home.",
            "【1500LBS Capacity Solid and Stable】This weight bench is constructed using high-quality, heavy-duty commercial-grade steel, ensuring exceptional strength and durability. With a load-bearing capacity of 1500 pounds, it is designed to safely support heavy weights during intense workouts. Through rigorous testing, we have ensured the bench's reliability and safety.",
            "【Two J-Hooks, Squat Bar Catches&Safety Catches】Our weight bench is equipped with two pairs of bar catches. The squat bar catch and safety catches can safely bear the weight falling from your hands or shoulders.Bar catch height is adjustable and allows for the bar to be reached in different seat positions to allow a safe and proper workout.",
            "【Seat Sliding Track -10°～80° Backrest Angles】This exercise equipment boasts an adjustable seat and back pad with a slide track, the backrest angles can be adjusted from -10° to 80° to conform to proper lifting positions. Almost vertical backrest angle makes more workouts with dumbbells available. It allows you to achieve the enhanced benefits of an intense workout performed with precise body alignment.",
            "【Foldable Design】The weight bench set can be folded up to reduce its occupied area and save space. You can simply put it in the basement or move it to the corner of home or office and put it against the wall.",
            "【Excellent Adjustability】This weight bench set offers a 5-position backrest that you can easily adjust to incline, flat and decline positions. The squat rack and preacher curl pad can both be adjusted to 9 heights. Please note that weights and barbell are not included.",
            "【Dual-function Leg Developer】100 lbs weight capacity on the leg developer. While doing leg extension and lying leg curl, you can get a full range of motion. Effectively exercise your hamstrings, quadriceps and calf muscles. Besides, you can lock the leg developer for abdominal exercise to build core strength.",
            "【Easy Assembly and Clear Instructions】The bench press set comes with all required tools and parts. With all bolts and nuts well sorted and labeled, it can be assembled with ease. MAIDOMA design and manufacture quality products at reasonable prices. We are committed to providing the best service for our customers."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "37 Kilograms"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "Black Red"
            },
            {
                "key": "Product Dimensions",
                "value": "61\"D x 42\"W x 62\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "900 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "MAIDOMA"
            },
            {
                "key": "Package Weight",
                "value": "86 Pounds"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "61 x 42 x 62 inches"
            },
            {
                "key": "Brand Name",
                "value": "MAIDOMA"
            },
            {
                "key": "Part Number",
                "value": "MA007184"
            },
            {
                "key": "ASIN",
                "value": "B0CM651XC5"
            },
            {
                "key": "Date First Available",
                "value": "October 31, 2023"
            }
        ],
        "equipment_options": [
            {
                "name": "Black Red",
                "weight": 37.0,
                "price": 249.99,
                "remaining_products": 80,
                "color": "Red, Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41UndqYcU8L._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61hieGwpcVL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/716EuJCjLtL._AC_SL1328_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61kR2UCPn9L._AC_SL1328_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71673poy1LL._AC_SL1280_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61dB1uDX1ZL._AC_SL1328_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61X2RUUTUtL._AC_SL1283_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61QR0y1airL._AC_SL1328_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "Vermeil",
                "weight": 37.0,
                "price": 249.99,
                "remaining_products": 40,
                "color": "Black Red",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41oKMjzYLAL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61kW7SJtukL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71oxewwkaXL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71xGFKy9mIL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71OIsE8n4hL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71QNCY5NEUL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71xUyFm4S-L._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/71Vrd4hHY-L._AC_SL1500_.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B00FJ2PL26",
        "title": "Marcy Adjustable 6 Position Utility Bench with Leg Developer and High Density Foam Padding SB-350,dark gray",
        "price": 169.99,
        "brand": "MARCY",
        "description": "Sculpt yourself and make your dream body a reality with the Marcy Utility Bench SB-350 This bench has an adjustable back that can be altered to suit your workout routine or regimen. Its secure sawtooth back pad adjustment design that can be altered to an incline, flat, or decline position. This multiple seatback positioning allows strength training exercises such as crunches and weightlifting. You can use this bench to lift dumbbells and barbells or performing tool-free exercises such as sit-ups. You can also perform leg curls and other muscle-toning routines on this training equipment in order to sculpt your legs to match your toned upper body. This sleek black bench’s foam roller pads have a vinyl covering and a hardwearing, powder-coated finish. It also has a convenient transport handle. Additionally, this training device is suitable for the whole family, so everyone can use it to improve their bodies and health. The ergonomic bench’s dual position leg developer has a two-position padded bar and weight posts that let you do leg extensions and curls. You can strengthen your calves and hamstrings, sculpt your quads and glutes, and gain a leaner figure through this helpful feature. The bench’s powder-coated steel frame offers great resiliency with a maximum weight capacity of 300 pounds. It is strong and sturdy so you’ll be able to pump iron at home for years to come. This bench is designed to fit most standards racks, cages, and Smith machines. Work out with optimal efficiency and without worrying about the training equipment’s construction. Its top grade high density foam padding allows users to exercise comfortably on the equipment, boasts exceptional durability, withstands pressure, and is guaranteed to resist heavy lifting. Target your oblique and abs without any hassle. Gain a better body in the comfort of your own home with the Marcy Utility Bench SB-350.",
        "features": [
            "6-POSITION ADJUSTABLE BACK PAD – This utility bench has an adjustable back that can be altered to suit your workout routine. It features a secure sawtooth back pad adjustment design that can be modified to an incline, flat, or decline position.",
            "HIGH-DENSITY FOAM PADDING– This bench’s top-grade foam paddingallows users to exercise comfortably on the equipment.",
            "Durable Construction – The Marcy Utility Bench’s powder-coated steel frame provides great resiliency, with a maximum weight capacity of 600 pounds.",
            "COMFORTABLE FOAM ROLLERS–The foam roller pads have a vinyl covering and a hardwearing, powder-coated finish. This sleek black bench also has a convenient transport handle and wheels."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "51 Pounds"
            },
            {
                "key": "Material",
                "value": "Vinyl, Foam, Alloy Steel"
            },
            {
                "key": "Color",
                "value": "black"
            },
            {
                "key": "Product Dimensions",
                "value": "23\"D x 64.5\"W x 42\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "600 Pounds"
            },
            {
                "key": "Global Trade Identification Number",
                "value": "00096362992732"
            },
            {
                "key": "Manufacturer",
                "value": "Marcy"
            },
            {
                "key": "UPC",
                "value": "096362992732"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "47 x 18 x 7 inches"
            },
            {
                "key": "Package Weight",
                "value": "24.95 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "23 x 64.5 x 42 inches"
            },
            {
                "key": "Brand Name",
                "value": "MARCY"
            },
            {
                "key": "Suggested Users",
                "value": "unisex-adult"
            },
            {
                "key": "Number of Items",
                "value": "1"
            },
            {
                "key": "Part Number",
                "value": "SB350"
            },
            {
                "key": "Style",
                "value": "Utility"
            },
            {
                "key": "Included Components",
                "value": "one adjustable utility bench, Warranty card, User manual"
            },
            {
                "key": "Size",
                "value": "One Size"
            },
            {
                "key": "ASIN",
                "value": "B00FJ2PL26"
            },
            {
                "key": "Date First Available",
                "value": "March 7, 2014"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 51 Pounds 169.99",
                "weight": "51 Pounds",
                "price": 169.99,
                "remaining_products": 2,
                "color": "black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/71hx828LZoL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41Ip7ugk7PL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41gjtyY+wQL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51EODLQJVHL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51XjYkl3M7L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51K+QMueUxL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/31UqCq0V7CL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0C33WT4VS",
        "title": "Titan Fitness T3 or X3 Series Plate-Loaded Leg Curl and Extension Rack Attachment, Rated 275 LB, Perform One-Leg Hamstring Curls Or Seated Leg Extensions",
        "price": 499.99,
        "brand": "Titan Fitness",
        "description": "The Rack Mounted Leg Curl and Extensions attachment helps to provide leg strength, balance, and coordination when performing one-leg hamstring curls or seated leg extensions. The attachment features a unique leg roller pad, a square seat pad that adjusts with a turn knob for seated or standing movements, and a quick-mount J-hook style design that easily secures on either T-3 or X-3 Series Power Racks. By mounting to the inside of the power rack, you can utilize the uprights as a stabilizing factor helping with proper form during standing leg curl movements. Reduces the risk in hamstring and knee injuries with the benefit of this versatile plate-loaded rack attachment.FEATURES:- Compatible with the T-3 and X-3 Series Power Racks- Installation hardware included for T-3 and X-3 Series- Perform standing leg curl movements and seated extensions- Isolates the hamstrings and reduces risk in hamstring and knee injuries- Fits Olympic sized weight plates- Turn knob to adjust bottom pad for different heights- Nylon liner to protect the rack uprightsSPECIFICATIONS:- Overall Height: 18-in.- Overall Width: 43-in.- Overall Depth: 25-in.- Weight Sleeve Length: 9.75-in.- Weight Sleeve Diameter: 50 mm- Round Pad Length: 17.5-in.- Round Pad Diameter: 5-in.- Square Pad Width: 18-in.- Square Pad Depth: 22-in.- Square Pad Thickness: 2-in.- Finish: Powder-Coated Black- Material: Steel- Max User Weight: 265 lb.- Weight Plate Capacity: 275 lb.- Product Weight: 85 lb.",
        "features": [
            "Compatible with the T-3 and X-3 Series Power Racks; Installation hardware included for T-3 and X-3 Series",
            "Perform standing leg curl movements and seated extensions; Isolates the hamstrings and reduces risk of hamstring and knee injuries",
            "Fits Olympic sized weight plates",
            "Nylon liner to protect the rack uprights",
            "Turn the knob to adjust the bottom pad for different heights"
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "85 Pounds"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "Black"
            },
            {
                "key": "Product Dimensions",
                "value": "43\"D x 25\"W x 18\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Manufacturer",
                "value": "Titan Fitness"
            },
            {
                "key": "UPC",
                "value": "840009233708"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "30 x 25 x 16 inches"
            },
            {
                "key": "Package Weight",
                "value": "86 Pounds"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "30 x 25 x 16 inches"
            },
            {
                "key": "Brand Name",
                "value": "Titan Fitness"
            },
            {
                "key": "Number of Items",
                "value": "1"
            },
            {
                "key": "Part Number",
                "value": "T3X3RACKCRL"
            },
            {
                "key": "ASIN",
                "value": "B0C33WT4VS"
            },
            {
                "key": "Date First Available",
                "value": "April 19, 2023"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 85 Pounds 499.99",
                "weight": "85 Pounds",
                "price": 499.99,
                "remaining_products": 17,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/51NUd0Tk4LL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/31h5rDc5krL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/4168gnmXFPL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41EnmX-G78L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41z59gaCXoL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/31z4OmWPOHL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41jLOoCjR8L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41EUEtVhSIL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0069U8U9I",
        "title": "Valor Fitness EX-1 Leg/Curl Extension Attachment (Bench NOT Included/Compatible Benches Only)",
        "price": 89.98,
        "brand": "Valor Fitness",
        "description": null,
        "features": [
            "SOLID CONSTRUCTION: Built with 1.75” x 1.75” solid steel tubing, ensuring stability and support during intense leg workouts.",
            "COMFORTABLE SUPPORT: Equipped with foam rollers that cushion the back of the knees and ankles, facilitating a comfortable, effective workout.",
            "VERSATILE TRAINING OPTIONS: Enables you to perform both leg extensions to target the quadriceps and leg curls to focus on the hamstrings, adding variety to your lower body routine.",
            "ADJUSTABLE FOR PERSONALIZATION: Features multiple adjustment positions to accommodate users of different heights, ensuring an optimal fit and maximizing workout effectiveness.",
            "WEIGHT CUSTOMIZATION: Includes a plate peg compatible with both standard and Olympic plates, allowing you to easily adjust the intensity of your workouts.",
            "COMPATIBILITY: Specifically designed to attach to Valor Fitness BF-39, DD-4, and DD-25 benches, expanding the functionality of your equipment."
        ],
        "attributes": [
            {
                "key": "Product Dimensions",
                "value": "20\"D x 15.4\"W x 15.5\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "200 Pounds"
            },
            {
                "key": "Global Trade Identification Number",
                "value": "00844192001762"
            },
            {
                "key": "Manufacturer",
                "value": "Valor Fitness"
            },
            {
                "key": "UPC",
                "value": "844192001762"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "20.5 x 19.5 x 4.75 inches"
            },
            {
                "key": "Package Weight",
                "value": "6.92 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "21 x 20 x 5 inches"
            },
            {
                "key": "Brand Name",
                "value": "Valor Fitness"
            },
            {
                "key": "Warranty Description",
                "value": "3-year frame. 2-year pad"
            },
            {
                "key": "Suggested Users",
                "value": "unisex-adult"
            },
            {
                "key": "Number of Items",
                "value": "1"
            },
            {
                "key": "Part Number",
                "value": "EX-1"
            },
            {
                "key": "Model Year",
                "value": "2016"
            },
            {
                "key": "Included Components",
                "value": "Leg Curl/Extension Attachment"
            },
            {
                "key": "ASIN",
                "value": "B0069U8U9I"
            },
            {
                "key": "Date First Available",
                "value": "November 18, 2011"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 14 Pounds 89.98",
                "weight": "14 Pounds",
                "price": 89.98,
                "remaining_products": 45,
                "color": "Multi",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/716+lqLho+L._AC_SY300_SX300_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/31wECbz3r-L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/519dB8Hqg2L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51jX-t8iMdL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51cgdC+qyvL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51+QiJ-+ftL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41+Lnn5JieL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51WaLGPVQ+L._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "model_name": "EX-1",
        "color": "Multi",
        "material": "Alloy Steel",
        "weight": "14 Pounds",
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0D5D4MFG5",
        "title": "FLYBIRD Adjustable Weight Bench with Leg Extension and Curl Machine, Preacher Curl Bench, Foldable Workout Bench for Home Gym, 800LBS Weight Capacity Exercise Bench for Full Body Strength Training",
        "price": 159.99,
        "brand": "FLYBIRD",
        "description": null,
        "features": [
            "Sturdy Multifunctional Bench: The FLYBIRD preacher curl bench is crafted from a sturdy and thick steel frame, offers 800 lbs weight capacity and outstanding stability during the entire bench workout; The trapezoid structure further enhances the stability",
            "Widened Preacher Curl Pad: The 14.6\" wide preacher curl pad offers a larger area to exercise your arms effectively; Has 3 angles and 7 heights to better adapt to your body and movement; Can also used to do hyper back extension",
            "Leg Extension and Curl: Leg extension machine helps to exercise leg muscles with 1-in weight storage post; High-resilience columnar foam and 15.6-in extended seat cushion enhance comfort; Collision chock can cushion and provide sufficient room for legs",
            "32.7'' Extended Backrest: The weight bench is suitable for user up to 6'3''; Activate different muscles through 7 back angles, which can be adjusted and locked in 1 step with self-rebounding pin; Lock the leg extension and stabilize legs while do push-ups",
            "Simply Fold to Store: FLYBIRD workout bench can be easily folded by just pulling 2 pins; Is able to stand independently, easier to store the exercise bench; There's a protective pad at the top of the backrest to prevent the cushion from wear and tear",
            "Installation Video and Easy Assembly: We provide an installation video to help you install the adjustable weight bench effortlessly; All the accessories of this preacher curl weight bench are packed in an accessory bag to ensure that all parts are intact"
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "16.3 Kilograms"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "msd-1"
            },
            {
                "key": "Product Dimensions",
                "value": "50.6\"D x 21.26\"W x 18.5\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "800 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "FLYBIRD"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "36.65 x 12.25 x 10.45 inches"
            },
            {
                "key": "Package Weight",
                "value": "18.94 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "50.6 x 21.26 x 18.5 inches"
            },
            {
                "key": "Brand Name",
                "value": "FLYBIRD"
            },
            {
                "key": "ASIN",
                "value": "B0D5D4MFG5"
            },
            {
                "key": "Date First Available",
                "value": "May 28, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 16.3 Kilograms 159.99",
                "weight": "16.3 Kilograms",
                "price": 159.99,
                "remaining_products": 40,
                "color": "msd-1",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/71xK4dDTu6L.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41Dc16YDeNL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51+OFXf0A0L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51m+F57O0cL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51-qILUglUL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51vfr1-jgyL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51SE3n4v83L._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0BC5JCKLQ",
        "title": "Utility Weight Bench with Leg Extension - Multi-Position Adjustable Bench for Strength Training, Dumbbell Exercise and Ab Workouts",
        "price": 129.99,
        "brand": "EASY BIG",
        "description": null,
        "features": [
            "This adjustable weight bench is designed for home use only. It has 4 backrest pad positions that you can easily switch to match your body and target different muscles. You can use it to work on your chest, shoulders, back, abs, or legs, without leaving your house.",
            "This press bench is not only versatile, but also effective. It can help you train and work out your whole body, from your upper body to your lower body. You will notice a significant increase in your strength and endurance. The leg curler can hold up to 45 lbs/20 kgs, so you can challenge yourself and get the best results. It is compact and quiet, making it ideal for home use.",
            "You can trust this bench to be safe and reliable. It is made of thick and sturdy steel that has undergone thousands of weight tests. It will not wobble or collapse under pressure. It is a high-quality bench that will last for a long time. However, it is not suitable for commercial or professional use, as it may not meet the standards or regulations of some gyms or fitness centers.",
            "This bench is also comfortable and ergonomic. It has high-density foam padding and a seat that conform to your body and support your spine and joints. Doing bench presses regularly on this bench will not only boost your muscle mass, but also your bone health and density. It is designed to reduce the risk of injury and pain, making it ideal for home use.",
            "This adjustable dumbbells bench is suitable for users of different heights and weights. It can handle up to 330 lbs/150 kg with reinforced support pipes that ensure stability and durability. The recommended user height is under 180 cm/5.8 ft, but you can still use it if you are taller, just be careful not to hit your head on the bar. You can adjust the weight of the dumbbells according to your level and preference, making it perfect for home use."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "15 Kilograms"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "Black with Chain Handle (Upgraded Version)"
            },
            {
                "key": "Product Dimensions",
                "value": "31.5\"D x 13.78\"W x 7.87\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "300 Kilograms"
            },
            {
                "key": "Manufacturer",
                "value": "EBO"
            },
            {
                "key": "UPC",
                "value": "788125583577"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "32.4 x 14.1 x 8.5 inches"
            },
            {
                "key": "Package Weight",
                "value": "15.47 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "57.09 x 17.72 x 46.85 inches"
            },
            {
                "key": "Brand Name",
                "value": "EASY BIG"
            },
            {
                "key": "Part Number",
                "value": "O2K0023"
            },
            {
                "key": "ASIN",
                "value": "B0BC5JCKLQ"
            },
            {
                "key": "Date First Available",
                "value": "August 28, 2022"
            }
        ],
        "equipment_options": [
            {
                "name": "Black with Chain Handle (Upgraded Version)",
                "weight": 15.0,
                "price": 129.99,
                "remaining_products": 33,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/419WdcZujoL._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51A1zPDaHvL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51t7+FAmKcL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/517M9FxIWYL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61S1Q2vvf-L._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/515j3rILbWL._AC_SL1309_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61wZY3zWZBL._AC_SL1206_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61y2i6C7hyL._AC_SL1354_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "Black (Upgraded Version)",
                "weight": 15.0,
                "price": 149.99,
                "remaining_products": 19,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41+JTVzGo-L._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51bdJuY8ebL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61NidQOyDlL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/619JB58pwfL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61JLkjrwJvL._AC_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51vk09XexRL._AC_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/813k3Z3JQbL._AC_SL1500_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61euZTB4lfL._AC_SL1200_.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0D6RC3X4K",
        "title": "Hyperextension Roman Chair - Adjustable Bench Foldable Exercise Bench Back Extension Machine Roman Chair Exercise Equipment for Home",
        "price": 119.99,
        "brand": "Houbos",
        "description": null,
        "features": [
            "【HOME FITNESS HYPEREXTENSION TRAINING】Our fitness bench helps strengthen the back while improving your posture, mobility, and balance. This exercise bench can relieve lower back stiffness and reduce the risk of any future injuries.",
            "【MULTI PURPOSE WORKOUT】This hyperextension bench is used for upper and lower body workouts for a convenient, all-in-one solution for sculpting your muscular core.",
            "【STURDY BUILD】This back extension machine features a sleek and sturdy compact steel frame design for home, allowing a maximum weight capacity 250 lbs.The recommended user height is under 185 cm/6 ft, but you can still use it if you are taller, just control the center of gravity when you exercise properly;",
            "【HEIGHT-ADJUSTABLE】Our Houbos gym bench can be 8 gears adjustable for different height requirements, allowing you to change up your workouts and add variety to your strength and training routines.",
            "【FOLDABLE FOR EASY STORAGE】This compact and foldable sit up bench is designed for easy storage and is ideal. Our exercise bench provides complete high-quality upper and lower body workouts in the comfort of your home.Ideal for beginners and more advanced users as a home gym.",
            "【EASY TO ASSEMBLE】With upgraded user's manual and hardware packaging, it can be assembled in under 30 mins. Our five star customer service team is standing by to solve any questions you may have."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "19.8 Pounds"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "Black"
            },
            {
                "key": "Product Dimensions",
                "value": "36.2\"D x 16.9\"W x 32.3\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "250 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "Houbos"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "25.2 x 15.35 x 6.06 inches"
            },
            {
                "key": "Package Weight",
                "value": "11.2 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "36.2 x 16.9 x 32.3 inches"
            },
            {
                "key": "Brand Name",
                "value": "Houbos"
            },
            {
                "key": "Part Number",
                "value": "45RM"
            },
            {
                "key": "ASIN",
                "value": "B0D6RC3X4K"
            },
            {
                "key": "Date First Available",
                "value": "June 11, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 19.8 Pounds 119.99",
                "weight": "19.8 Pounds",
                "price": 119.99,
                "remaining_products": 34,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/61XCDPbMJKL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/410JptL-x0L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/31kkV-dK7VL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51aU6gGfvFL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51Qyu580orL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51ZFncFKt+L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51tnPM9e90L._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B07GYXF65S",
        "title": "Finer Form Multi-Functional Weight Bench for Full All-in-One Body Workout – Versatile Adjustable Workout Bench for Home Gym. Fitness equipment perfect for Back HyperExtension, Bench Press, Roman Chair Exercise, Sit up. Adjusts to Decline or Flat Bench.",
        "price": 149.99,
        "brand": "FF Finer Form",
        "description": null,
        "features": [
            "Full-body Adjustable Weight Bench - Work Your Arms, Back, Chest, Glutes, Hamstrings and Core. Use for Bench Press, As a Back Extension Machine Or for Hundreds of Other Weight Training Exercises.",
            "Lift with Confidence - Our Multi-functional Workout Bench Works Well with Weights Dumbbells Set and are Made with High Grade Steel for Hard Workouts. Great Exercise Bench for Home Gym.",
            "Comfortable and Sturdy - This Multi-functional Adjustable Bench is Designed with Triangular Base Support and Thick Cushion Pad. Beats Most Other Gym Equipment for Home.",
            "Easy To Assemble - The Strength Training Benches and Work Out Bench Assembles in About 30 Mins. Also Works as Sit Up Exercise Equipment.",
            "Perfect for Hyperextensions and Ab Work - Weight Bench Adjustable for 100s Of Exercises. Replaces Multiple Weight Benches for Home Gym. Sturdy and Highly-rated Among Workout Benches for Home Use.",
            "Responsive Customer Service Team - We Solve Any Issues with Our Weight and Fitness Benches Immediately. We Respond to Emails and Service Inquiries ASAP To Make Sure You Get Your Workouts In.",
            "Free Workout Chart Included - Enhance Your Adjustable Bench for Home Gym Experience with a Free Workout Chart, Guiding You Through Effective Exercises on Your Hyperextension Bench for Total Body."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "17.2 Kilograms"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "Black, Red"
            },
            {
                "key": "Product Dimensions",
                "value": "60.5\"D x 19.75\"W x 16.5\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "660 Pounds"
            },
            {
                "key": "EU Spare Part Availability Duration",
                "value": "1 Years"
            },
            {
                "key": "Manufacturer",
                "value": "FF Finer Form"
            },
            {
                "key": "UPC",
                "value": "680193710605"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "43.95 x 14.45 x 6.79 inches"
            },
            {
                "key": "Package Weight",
                "value": "17.67 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "22.6 x 58.7 x 34.7 inches"
            },
            {
                "key": "Brand Name",
                "value": "FF Finer Form"
            },
            {
                "key": "Part Number",
                "value": "FF-TB011384"
            },
            {
                "key": "Size",
                "value": "Flat-Decline"
            },
            {
                "key": "ASIN",
                "value": "B07GYXF65S"
            },
            {
                "key": "Date First Available",
                "value": "August 30, 2018"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 17.2 Kilograms 149.99",
                "weight": "17.2 Kilograms",
                "price": 149.99,
                "remaining_products": 85,
                "color": "Black, Red",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/61nLeVE+-uL._AC_SY300_SX300_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/411VhSaOhmL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/411CPLdvUKL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51+9G0ewXlL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51yE-wbdJtL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0CRYPYRZK",
        "title": "KeppiFitness Adjustable Weight Bench, Bench3000 MAX Heavy Duty Workout Bench Press with Leg Extension and Preacher Pad for Home Gym Fitness, Flat Incline Decline Sit Up Bench",
        "price": 399.99,
        "brand": "Keppi Fitness",
        "description": null,
        "features": [
            "Upgraded Multi Functional Weight Bench - With a weight capacity of 1200 lbs. The frame of weight bench is made of 2.7”*1.9” commercial thickness steel to ensure safety and durability during high intensity workouts.",
            "Extra Stable Double Bearing Design - The two rotating sections use bearings for providing you the outstanding smooth with no jamming and make legs training more stable.",
            "Removable Leg Extension and Preacher Pad - Workout bench equips with an extra removable leg extension and a preacher pad which offers you more versatility likes legs workout, bench press, etc.",
            "12+3 with Multi-Angle Adjustment - Adjustable weight bench provides 12 backrest pad positions, 3 positions for seat position, quickly adjustment for incline, decline, and flat by simply releasing the metal locking pins.",
            "Barbell Rack on the Workout bench - The barbell rack fits Olympic barbells (inner hole 2 inches) and normal one-inch barbells (inner hole 1 inch) to help you storage your barbell plates and add it to your bar or for legs extension.",
            "Incline/Decline Angles in lines - Adjusting the backrest and seat into the same angle for the whole bench, the workout plate will in lines which is flat enough for core training and adds variety of choices to your workouts.",
            "Pad Sewing Technology - The Pad of adjustable weight bench is made with a great sewing process to keep its durability, and the soft foam protects you from injury while exercising to make you more focused on your exercise.",
            "Easy to Assemble and Move - Quick assembly, the wheels under the legs and the handle on the foot cushion allow you to easily move this weight bench. Adjusting the knob under the rear foot tube to keep the balance for the bench.",
            "5 Years Product Support Service - KeppiFitness is responsible for the quality of our products, we provide 5 years support service please consult our team if you have any questions."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "76 Pounds"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "BLACK"
            },
            {
                "key": "Product Dimensions",
                "value": "77.2\"D x 23.3\"W x 51.1\"H"
            },
            {
                "key": "Frame Material",
                "value": "2.7*1.9 commercial thickness steel"
            },
            {
                "key": "Weight Limit",
                "value": "1200 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "Keppi Fitness"
            },
            {
                "key": "UPC",
                "value": "632125458642"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "47 x 25 x 8 inches"
            },
            {
                "key": "Package Weight",
                "value": "40.37 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "46.6 x 23.6 x 7.9 inches"
            },
            {
                "key": "Brand Name",
                "value": "Keppi Fitness"
            },
            {
                "key": "Part Number",
                "value": "F01324001"
            },
            {
                "key": "ASIN",
                "value": "B0CRYPYRZK"
            },
            {
                "key": "Date First Available",
                "value": "January 10, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 76 Pounds 399.99",
                "weight": "76 Pounds",
                "price": 399.99,
                "remaining_products": 15,
                "color": "BLACK",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/71TJTB8wFUL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/415hxggTeKL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51kdpon+cJL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51l02jCra3L._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51s2UIpRzUL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51iWpafbRuL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51Ld7DLILBL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51RyvDe5rbL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0D5WLGV4B",
        "title": "SPART Leg Extension and Curl Machine, Adjustable Lower Body Specialty Machine for Seated Leg Extension/Curl and Lying Leg Curl, Plate Loaded Leg Rotary Exercise Bench for Thigh in Home Gym",
        "price": 299.99,
        "brand": "SPART",
        "description": null,
        "features": [
            "💪【ALL IN ONE 2023 NEW DESIGN】: Perform both Sitting Leg Curl & Leg Extension and Horizontal / Lying Leg Curl with this lower body specialty machine.SPART 2023 new design leg extension and leg curl machine breaks old squat and deadlift plateaus with leg extension, leg curl and glute bridge that target your lower body.This leg machine isolates the quadriceps and hamstrings while providing a full range of motion through each movement.",
            "💪【COMMERCIAL RATED MATERIAL】: This leg extension machine is made of 50x50 mm,14 gauge tube. This commercial grade leg extension and curl machine is designed to withstand a heavy workout.",
            "💪【COMPLETELY ADJUSTABLE】: Designed with 8-position adjustable 3-inch thick backrest pads, 32-position adjustable rotary leg extension and 6-position removable & adjustable leg pads, this machine fits various person in home gym.",
            "💪【1\" & 2\" PLATE LOADED】: The 11-inch long weight holder can be hung with enough plates to achieve the training effect you want. Can fit both 1\" standard and 2\" olympic weight plates (weight plates are not included).The weight storage pin was added not only to make it easier to pick up plates, but also to increase the stability of the whole leg machine.Can store both 1\" & 2\" weight plates.",
            "💪【MORE COMFORT】: We specialize increasing the edge of the cushion to add a thicker curvature more suitable for leg curl and extension, providing better support to challenge higher goals.The oversize rollers work your quad muscles during leg extension exercise, while the thick padding ensures exceptional comfort and durability.",
            "✅【WHY CHOOSE SPART】: SPART has always been a brand dedicated to customer service, and we promise to do our best to satisfy our customers. We are responsible for the quality of this leg curl and leg extension machine, order today to get a 2-Year warranty. Our customer service team will solve any issues in 24 hours.Just buy it!"
        ],
        "attributes": [
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "37.4 x 30.71 x 9.45 inches"
            },
            {
                "key": "Package Weight",
                "value": "105 Pounds"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "58.3 x 41 x 44 inches"
            },
            {
                "key": "Brand Name",
                "value": "SPART"
            },
            {
                "key": "Warranty Description",
                "value": "1 Year"
            },
            {
                "key": "Suggested Users",
                "value": "unisex-adult"
            },
            {
                "key": "Manufacturer",
                "value": "SPART"
            },
            {
                "key": "Included Components",
                "value": "1x Leg Curl Extension Machine"
            },
            {
                "key": "ASIN",
                "value": "B0D5WLGV4B"
            },
            {
                "key": "Date First Available",
                "value": "June 1, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "GOLDEN",
                "weight": 47.627159999999996,
                "price": 299.99,
                "remaining_products": 91,
                "color": "Gold",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41T+YhdIt0L._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51TOnv9iHUL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51cXd7BGpYL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51H4CQ13qSL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61a60za9T2L._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/519hzErGG8L._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61028hgJYNL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61gj1apouXL._AC_SL1000_.jpg",
                        "is_primary": false
                    }
                ]
            },
            {
                "name": "BLACK",
                "weight": 47.627159999999996,
                "price": 299.99,
                "remaining_products": 33,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/41nz4fqxP3L._AC_US.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51TWVsFyHtL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51upF9XOQRL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51wVjQ78SuL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61rN83y9UzL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51fwIBYKMhL._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/6133265MT4L._AC_SL1000_.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/61hzILgrhOL._AC_SL1000_.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "model_name": "AX1030Z-HX-GOLDEN",
        "color": "GOLDEN",
        "material": "Steel",
        "weight": "105 Pounds",
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0CWPK9QH5",
        "title": "Freestanding Leg Extension Leg Curl Attachment, Black",
        "price": 299.99,
        "brand": "GEAR FOR FIT",
        "description": "Designed to accommodate benches without built-in leg options, it offers adjustable height and depth settings, ensuring compatibility with various bench shapes. This attachment is versatile, supporting both 28mm and 50mm plates, thanks to its detachable weight horn. The standard horn diameter is 49mm, but after removal, it reduces to 25mm. Furthermore, its compact size and freestanding nature allow for easy storage in any available space.",
        "features": [
            "34\" L, 23\" W, 29\" H, Weight: 56lb",
            "Massive 500 Lb Capacity",
            "10.5\" Weight sleeve length with removable 2\" chrome adapter.",
            "Fully adjustable to accommodate any user",
            "Build-in wheels to easily move it around"
        ],
        "attributes": [
            {
                "key": "Color",
                "value": "Black"
            },
            {
                "key": "Style",
                "value": "Modern"
            },
            {
                "key": "Item Weight",
                "value": "56 Pounds"
            },
            {
                "key": "Product Care Instructions",
                "value": "Wipe with Dry Cloth"
            },
            {
                "key": "Installation Type",
                "value": "Screw-In"
            },
            {
                "key": "Leg Style",
                "value": "Straight"
            },
            {
                "key": "Recommended Uses For Product",
                "value": "strength training, leg workouts, fitness exercises, home gym activities"
            },
            {
                "key": "Specific Uses For Product",
                "value": "Leg curl exercises for strength training"
            },
            {
                "key": "Number of Pieces",
                "value": "1"
            },
            {
                "key": "Weight Limit",
                "value": "500 Pounds"
            },
            {
                "key": "Manufacturer",
                "value": "gearforfit"
            },
            {
                "key": "UPC",
                "value": "658238601867"
            },
            {
                "key": "Product Dimensions",
                "value": "29 x 29 x 29 inches"
            },
            {
                "key": "Department",
                "value": "Unisex-Adult"
            },
            {
                "key": "ASIN",
                "value": "B0CWPK9QH5"
            },
            {
                "key": "Date First Available",
                "value": "February 28, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 56 Pounds 299.99",
                "weight": "56 Pounds",
                "price": 299.99,
                "remaining_products": 11,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/71uEoLidn-L.__AC_SY300_SX300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41mpfjUpqIL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/617IC20tWSL.SS125_PKplay-button-mb-image-grid-small_.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B0CSDJTNSK",
        "title": "YAMO Flat Bench, 1455LBS/660KG Weight Bench for Home Gym, Easy Assembly Workout Bench with Adjustable foot Caps, Multipurpose Strength Training Bench Press for Full Body Workout",
        "price": 64.99,
        "brand": "YAMO",
        "description": null,
        "features": [
            "【Max Load 1455LBS/660KG】With a maximum load-bearing capacity of 1455LB/660KG, our fitness bench is engineered to withstand intense workouts and heavyweights. Crafted with thick steel material, the workout bench is built to last. The flat bench ensures stability even during the most challenging exercises.",
            "【Enhanced Comfort】The YAMO flat weight bench is built for comfort and performance. Our compact weight bench is a 2.4-inch thick cushion, crafted with a 6-layer trapezoidal structure for optimal support. The workout bench boasts upgraded high-density foam padding, ensuring the utmost comfort during your workout sessions, it provides the perfect support for your workouts.",
            "【Space-Saving Design】41.9*14.6*18 IN (106 *37*46 CM). With its compact size, the flat weight bench is easy to store and convenient for those with limited space. After use, it can be effortlessly placed in a small corner, allowing for a clutter-free workout area, making it ideal for apartments or small workout areas.",
            "【Full-Body Muscle Training】With its sturdy construction and comfortable cushioning, our home bench ensures a stable and supportive workout experience. Whether it's strength training, toning, or core exercises, our bench allows you to target multiple muscle groups efficiently and effectively and provides the support and range of motion you need for a complete workout.",
            "【Easy Installation】 Designed with user convenience in mind, our dumbbell bench is incredibly easy to assemble. With clear instructions and minimal tools required, you'll start your workout routine in no time. The convenience of mobility is an outstanding feature of our exercise bench. Whether you prefer exercising in the living room or want to soak up some sun in your backyard, our strength training bench is up for the challenge.",
            "【Adjustable Foot Caps】Our gym bench has adjustable foot pads. With this feature, you can easily modify the height of the foot pads to suit various types of surfaces. Whether you're exercising on a carpeted floor or a hardwood surface, our bench can be adjusted accordingly, providing you with optimal stability and support during your workouts."
        ],
        "attributes": [
            {
                "key": "Item Weight",
                "value": "9 Kilograms"
            },
            {
                "key": "Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Color",
                "value": "Black"
            },
            {
                "key": "Product Dimensions",
                "value": "42\"D x 14.6\"W x 18\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "660 Kilograms"
            },
            {
                "key": "Manufacturer",
                "value": "YAMO"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "42.91 x 11.54 x 3.94 inches"
            },
            {
                "key": "Package Weight",
                "value": "9.48 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "41.93 x 14.57 x 18.11 inches"
            },
            {
                "key": "Brand Name",
                "value": "YAMO"
            },
            {
                "key": "Part Number",
                "value": "YA-PW100"
            },
            {
                "key": "ASIN",
                "value": "B0CSDJTNSK"
            },
            {
                "key": "Date First Available",
                "value": "January 15, 2024"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 9 Kilograms 64.99",
                "weight": "9 Kilograms",
                "price": 64.99,
                "remaining_products": 23,
                "color": "Black",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/61GUqgKDOdL.__AC_SX300_SY300_QL70_ML2_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/31Z78+TEXOL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51Ri34187VL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51Jd1IfdzDL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51lWR0GRRnL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/512YfsvvhFL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    },
    {
        "asin": "B07HNLBZ4Y",
        "title": "FLYBIRD Adjustable Bench,Utility Weight Bench for Full Body Workout- Multi-Purpose Foldable Incline Bench (Black)",
        "price": 139.99,
        "brand": "FLYBIRD",
        "description": null,
        "features": [
            "【FLYBIRD】Design and produce fitness equipment for 20 years. Especially in WEIGHT BENCH, our designers develop with advice of professional fitness coach, pass all the test before shipping.",
            "【2022 High Quality Bench】Made of commercial thickness steel, past thousands of weight test to ensure safety for workout everytime, Not the mendacious bench.",
            "Never Been So Stable: FLYBIRD weight bench features an outstanding stable base and robust frame that is attributed to upgraded high-quality steel and triple triangle structure; Rigorous weight testing confirms its true capacity of 660 LBS, allowing you to lift with confidence and rock-solid support, powering your workouts to new heights.",
            "Boost Muscle and Strength: FLYBIRD workout bench is meticulously designed for a wide range of exercises—from powerful bench presses and versatile dumbbell flyes to challenging shoulder presses and core-toning sit-ups. Sculpt your ideal physique and unleash your full-strength potential",
            "Maximum Comfort & Exceptional Support: FLYBIRD workout bench features premium wear-resistant leather and 1.8\" thickened pad to provide maximum comfort and strong support for your back and hips. Even after prolonged use, the padding retains its shape without deformation or wrinkling",
            "Quick and Easy Adjustments: Easily customize your workout with 8 Backrests and 4 Seat positions—just pull the support bar to switch gears in seconds. Functioning as excellent incline, flat, and decline bench, FLYBIRD adjustable weight bench targets multiple muscle groups, including the chest, back, abs, arms, glutes, and shoulders, saving you time and money on trips to the gym",
            "Compact & Portable Design: Turn your home or office into a personal gym with the newly FLYBIRD workout bench; Easy to Carry & Quick Assembly; Save 80% of your space with our foldable design— Get your gym ready in 3 Mins",
            "Quality Comes First: Crafted for home fitness enthusiasts, FLYBIRD bench delivers performance, affordability, and durability; Order today and get 1 Year cover on the frame and parts; Our exceptional after-sales support is always here to assist you with any inquiries"
        ],
        "attributes": [
            {
                "key": "Product Dimensions",
                "value": "15.1\"D x 42.3\"W x 42.4\"H"
            },
            {
                "key": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "key": "Weight Limit",
                "value": "600 Pounds"
            },
            {
                "key": "EU Spare Part Availability Duration",
                "value": "7 Years"
            },
            {
                "key": "Global Trade Identification Number",
                "value": "00823540431703"
            },
            {
                "key": "Manufacturer",
                "value": "FLYBIRD"
            },
            {
                "key": "UPC",
                "value": "823540431703"
            },
            {
                "key": "Item Package Dimensions L x W x H",
                "value": "31 x 11.2 x 9.5 inches"
            },
            {
                "key": "Package Weight",
                "value": "11.93 Kilograms"
            },
            {
                "key": "Item Dimensions  LxWxH",
                "value": "15.1 x 42.3 x 42.4 inches"
            },
            {
                "key": "Brand Name",
                "value": "FLYBIRD"
            },
            {
                "key": "Warranty Description",
                "value": "1 YEAR"
            },
            {
                "key": "Suggested Users",
                "value": "Unisex-Adult"
            },
            {
                "key": "Part Number",
                "value": "99"
            },
            {
                "key": "Included Components",
                "value": "1"
            },
            {
                "key": "Size",
                "value": "Large"
            },
            {
                "key": "ASIN",
                "value": "B07HNLBZ4Y"
            },
            {
                "key": "Date First Available",
                "value": "June 12, 2018"
            }
        ],
        "equipment_options": [
            {
                "name": "Item 10.55 Kilograms 139.99",
                "weight": "10.55 Kilograms",
                "price": 139.99,
                "remaining_products": 93,
                "color": "A-Regular Weight Bench",
                "img": [
                    {
                        "link": "https://m.media-amazon.com/images/I/71+ANy+NtjL._AC_SY300_SX300_.jpg",
                        "is_primary": true
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41WTPRnAXnL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51EDFfPiGuL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51qmPMhAreL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51QULDamTAL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51C8SIp-1ZL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/41wD0lBwVZL._AC_US.jpg",
                        "is_primary": false
                    },
                    {
                        "link": "https://m.media-amazon.com/images/I/51SYXVn6htL._AC_US.jpg",
                        "is_primary": false
                    }
                ]
            }
        ],
        "model_name": "BENCH",
        "color": "A-Regular Weight Bench",
        "material": "Alloy Steel",
        "weight": "10.55 Kilograms",
        "muscle_group_used": [
            "ft_26",
            "ft_27"
        ]
    }
]